[
    "Our Verdict\nThe RSPCA Ultimate Plus Accident and Illness Cover policy is a reasonable choice for pet owners, with features on par with the industry standard, such as an 80% reimbursement rate and the option to add routine care at an additional cost. It does offer GapOnly services, which is a huge benefit for consumers, and while no excess can be beneficial, it also means that policyholders may be paying more in premiums.\n\nRelated: Best Pet Insurance Providers\n\nPros\nPositive reviews\nGapOnly is available\nNo sub-limit for tick paralysis\nCons\nRoutine care isn’t automatically included\nNo excess choices to lower premium\nAverage reimbursement rate\nRSPCA Pet Insurance\n3.8\n\nMaximum annual claim\n$15,000\nChoice of Excess\nNo\nGapOnly Payment\nYes\nTable of Contents\nAbout RSPCA Pet Insurance\nWhat’s Covered By RSPCA’s Pet Insurance?\nExcess Options\nAre there any discounts or bonuses?\nFinal Thoughts\n\nAbout Star Rankings\n\nYou will note that we have included a star rating next to each product or provider. This rating was determined by the editorial team once all of the data points above were considered, and the pros and cons of each product attribute was reviewed. The star rating is solely the view of Forbes Advisor editorial staff. Commercial partners or advertisers have no bearing on the star rating or their inclusion on this list. Star ratings are only one factor to be considered, and Forbes Advisor encourages you to seek independent advice from an authorised financial adviser in relation to your own financial circumstances and investments before you decide to choose a particular financial product or service.\n\nFeatured Partners\n\n\nAbout RSPCA Pet Insurance\nWhen you hear the name RSPCA, you likely think of animals. The Royal Society for the Prevention of Cruelty to Animals (RSPCA) is recognised as Australia’s leading animal welfare organisation, so it’s no surprise that the RSPCA released its own pet insurance product to Australian pet owners.\n\nTo create their pet insurance product line, the RSPCA partnered with PetSure Pty Ltd and the Hollard Insurance Company. The product is well regarded by customers Australia-wide, receiving a ranking of 4.3 stars from nearly 7,000 reviews on ProductReview.\n\nForbes Advisor Australia has analysed RSPCA’s most comprehensive pet insurance offering, being RSPCA Ultimate Plus Accident and Illness Cover policy. It’s available for both cats and dogs.\n\nWhat Type of Pets Does RSPCA Cover?\nRSPCA will only cover cats and dogs, including puppies and kittens. For special or exotic pets, you would need to find an alternative pet insurance policy provider.\n\nWhat’s Covered By RSPCA’s Pet Insurance?\nThe RSPCA offers four different levels of coverage, with plans tailored towards cats or dogs. The highest level of coverage is the RSPCA Ultimate Plus Accident & Illness Cover which, as the title intends, provides top-tier coverage in addition to accident and illness care.\n\nThe policy provides a $20,000 annual claim limit, which is on the upper side of the industry standard (most providers have a limit of $15,000). However, it only has a reimbursement rate of 80%, which is the standard for the industry, and considering this is RSPCA’s most premium plan, we would have liked to see a higher rate.\n\nA key benefit of RSPCA pet insurance is that GapOnly is offered. The GapOnly service means pet owners only have to pay the ‘gap’ between what the vet charges and what the insurer covers. If GapOnly isn’t offered, the pet owner would have to pay the full cost of the vet visit and be reimbursed after the fact from the pet insurance company.\n\nMore in-depth details of the policy inclusions and exclusions are explained below.\n\nIs spaying and neutering covered?\nSpaying and neutering (also known as desexing) is considered to be a routine care policy by the RSPCA–which the policy doesn’t automatically cover. Instead, pet owners must purchase the optional routine care cover in addition to the base policy.\n\nIn doing so, the policy will allow for the annual claim of heart-worm testing and urinalysis, and additionally an annual benefit of $50 that can be put towards a range of services, one of which is desexing.\n\nWhat about older pets?\nOlder pets can be covered by RSPCA granted there has been no break in cover before the age of nine years old. Policies are available from the age of eight weeks, and can continue for life if the cover doesn’t lapse. New policies are not available over the age of nine.\n\nIs there a sub-limit for tick paralysis?\nTicks are a large problem for our pets in Australia, and thankfully the RSPCA recognises this by not charging an annual sub-limit for tick paralysis. That means your pet will always be covered for tick paralysis treatment as long as it does not exceed the annual claims limit.\n\nIs Dental Covered?\nNo, dental is not covered within the RSPCA Ultimate Plus Accident and Illness Cover policy. Instead, the policyholder can choose to add the optional routine care cover package onto the policy, with the $50 annual benefit able to be claimed towards teeth cleaning.\n\nWhat about add-ons for alternative therapies?\nAlternative therapies are also available to be covered under the RSPCA policy if the routine care add-on is purchased. The $50 benefit can be put towards alternative therapies, but they are not covered in the base policy.\n\nExcess Options\nHaving a choice of excess means you have some control over the price of your policy: a higher excess means you pay less on an annual premium, while a lower excess generally means you’ll have a higher premium but will pay less upon making a claim.\n\nHowever, at the RSPCA, there is no excess. This means you don’t have to pay any money when making a claim, but you also cannot lower your premium by choosing a higher excess.\n\nHow long is the waiting period?\nIf you take out the RSPCA Ultimate Plus Accident and Illness Cover policy, there is no waiting period for treatment due to accidents. For illnesses, this waiting period increases to 30 days and cruciate ligament treatment is a six-month waiting period.\n\nThe RSPCA website states that these waiting periods may be waived on application upon consideration of certain factors.\n\nAre there any discounts or bonuses?\nThe RSPCA offers a 10% multi-pet policy discount, with the 10% discount applied to each additional policy. Additionally, at the time of writing, new policy-holders will get their first month free.\n\nFinal Thoughts\nWhile the RSPCA is synonymous with animal care, its pet insurance offering isn’t as premium as other pet insurance providers on the market. It has a good annual claims limit and offers a GapOnly service, which is hugely beneficial, but its lack of routine care, and other standard features, detracts from its overall value.\n\n    ",
    "The corporate regulator has allowed dozens of pet insurance policies to go back on the market after issuing a ban that lasted less than a day.\n\nKey points:\nASIC said it had concerns insurers were not properly considering customers' financial situations\nOn Thursday afternoon, ASIC revoked the bans on sales, saying the insurers had addressed the issues\nConsumer group Choice says the industry is \"emotionally manipulating people's love for their pets\"\nOn Thursday morning ASIC blocked the sale of 67 policies issued by major insurance underwriter Hollard and its subsidiary PetSure. \n\nThe orders meant Woolworths, the RSPCA, Petbarn, Guide Dogs, Medibank, Bupa, HCF and other companies had to immediately stop selling pet insurance.\n\nHowever, ASIC revoked the stop orders later in the afternoon, after the insurers addressed its concerns.\n\nWhen ASIC first blocked the policies from sale, it said it was concerned Hollard and PetSure had not properly considered the financial situations of customers when selling the products.\n\nIn particular, ASIC said insurers had failed to take into account consumers' ability to pay for vet treatments up front, before they could make a claim and get the funds reimbursed.\n\n\"ASIC made the interim orders to protect consumers from acquiring pet insurance products that may not be consistent with their objectives, financial situation or needs,\" the regulator said in a statement.\n\nDo you know more about the pet insurance industry? Contact Florance.Loretta@abc.net.au.\n\nPeople who already held the insurance policies were not affected by the stop orders.\n\nRetailers are now able to start selling the pet insurance policies again.\n\nWhy was the ban issued in the first place?\nASIC's issue boiled down to a document called a target market determination, or a TMD.\n\nTMDs are required for all financial products, and are basically public statements that describe what kind of customers the product is designed for, and any conditions around selling it to them.\n\nASIC told the pet insurers it was concerned their TMDs did not appear to consider the \"financial situations\" of the customers they were targeting.\n\nA fluffy dog with blue eyes sits on the ground, as someone uses a syrienge to inject medicine into its mouth.\nChoice said people's emotional attachment to their pets means they can be pressured into buying pet insurance. (Unsplash: Ayla Verschueren)\n\nThe requirement for customers to pay for vet bills up front before getting reimbursed was one thing ASIC felt the insurers did not fully take into account.\n\nIt also said customers' ability to pay premiums and gap costs did not seem to be properly considered.\n\nHollard and PetSure told the ABC they had revised the TMDs to address ASIC's concerns.\n\nInsurance industry in the 'crosshairs'\nThe brief stop order from ASIC followed years of scrutiny of the pet insurance industry.\n\nBack in 2019, consumer advocacy group Choice reviewed 86 pet insurance policies and concluded none were worth recommending.\n\nThe group's head of policy, Patrick Veyret, said the industry had improved since then, but was still full of poor products that did not work for consumers.\n\n\"It's our concern that pet insurers are emotionally manipulating people's love for their pets and selling them insurance they might not need,\" he told the ABC.\n\n\"Our research finds that there are still a lot of out-of-pocket costs when you take pet insurance and often it's not very good value for consumers.\"\n\nMr Veyret said problems were not limited to the pet insurance industry.\n\n\"We see incorrect selling and inappropriate selling across the entire insurance industry,\" he said.\n\n\"It's clear that ASIC has the broader industry in their crosshairs as well.\"\n\n    ",
    "Well-known brands including RSPCA, Woolworths and Medibank were temporarily blocked from selling pet insurance policies because the insurers failed to properly consider the financial situation of prospective customers.\n\nOn Thursday morning, the Australian Securities and Investments Commission (ASIC) issued 38 interim stop orders relating to 67 pet insurance products issued by The Hollard Insurance Company and PetSure Australia across different levels of cover.\n\nThese insurance products were issued via brands including Woolworths, RSPCA, Petbarn, Guide Dogs, Medibank, Bupa and HCF. On Thursday evening Hollard and Petsure said they had addressed ASIC’s concerns and the stop orders had been lifted.\n\nThe stop orders mean affected insurers will be barred from engaging in the distribution of their products to new customers.\nThe stop orders mean affected insurers will be barred from engaging in the distribution of their products to new customers.Credit:Nine\n\nThe stop orders had meant affected insurers were briefly barred from selling their products to new customers. ASIC said it had taken the action because the insurance companies had failed to properly consider the financial situation of prospective customers.\n\n“ASIC made the interim orders to protect consumers from acquiring pet insurance products that may not be consistent with their objectives, financial situation or needs,” the regulator said on Thursday morning, before the orders were revoked.\n\nASIC’s action comes after pet ownership boomed during the lockdown periods, with average annual vet expenses estimated to cost close to $400 for dogs and around $270 for cats before factoring in medications, surgery and emergency treatment – the cost of which can escalate quickly.\n\nASIC’s stop orders had no impact on existing pet insurance policyholders.\n\nThe regulator said it was concerned that the insurers failed to use objective and tangible parameters in defining their target market. For example, it said the insurers had not given proper consideration to consumers’ ability to afford premiums and pay for treatments upfront, before being partially reimbursed by the insurer after a claim is approved.\n\nAdvertisement\n\nIt comes after the regulator conducted a risk-based, targeted review of insurance target market determinations - documents setting out who the product is suited to.\n\nASIC said it expected insurers to consider the concerns raised regarding target market determinations and take immediate steps to ensure compliance. “ASIC will consider making a final order if the concerns are not addressed in a timely manner,” it warned.\n\nChoice head of policy and government relations Patrick Veyret said ASIC’s action was a welcome development for a product that the consumer advocacy group has previously flagged problems with.\n\n“In 2019, Choice awarded the entire pet insurance industry a Shonky award for ‘emotionally manipulating’ pet owners into buying poor-value insurance,” Veyret said. “Choice experts found pet insurance policies riddled with exclusions, many with unfair terms and conditions buried deep in the product disclosure statement. Some insurers have improved their products since then, but it’s clear they still need to do much better.”\n\nVeyret said the group was concerned about ASIC’s finding that pet insurers may be selling people policies who may not be able to afford it, particularly as people across Australia faced heightened cost of living pressures.\n\n\n\nThe insurers said ASIC’s orders would not affect existing customers, who can still make claims. The companies will have an opportunity to make submissions before a decision is made about any final stop orders.\n\nA PetSure spokesperson said on Thursday night: “PetSure can confirm, after consultation with ASIC, that we have addressed the concerns raised with the Target Market Determination and subsequently, the interim stop order has been lifted.“\n\nA Hollard spokesperson said: “Hollard can confirm after consultation with ASIC that we have addressed the concerns raised with the Target Market Determination and subsequently the interim stop order has been lifted”\n\n    ",
    "\nThere’s no denying that Australians love their pets. As a nation, we’re now spending more than $33 billion a year to keep them healthy and happy, according to the results of a landmark 2022 survey of pets and people by Animal Medicines Australia.\n\nThe survey also revealed that pets are present in 69% of Australian households—one of the highest rates in the world—whereas pre-pandemic, pets were present in 61% of Australian homes. Some 84% of dog owners and 69% of cat owners took their animals to the vet at least once in the last 12 months—mostly for general checkups and vaccinations.\n\nHowever, with the cost of living still high, some pet owners are making difficult decisions about their pets’ care. Some 68% of those surveyed by Animal Medicines Australia said they had considered not going to the vet due to cost. Furthermore, a Pet Insurance Australia survey in May 2024 found that more than 50% of pet owners were changing their approach to their pets’ well-being due to cost, with 21.5% of people ‘scaling back’ on regular check-ups and preventive care appointments.\n\n“While postponing vet visits for minor concerns might seem financially prudent initially, it can result in exacerbated health issues for pets and higher expenses for owners in the long term,” spokesperson for Pet Insurance Australia Nadia Crighton said.\n\nFor some, a savings plan will be necessary to sock away money for routine check-ups and unforeseen accidents and illnesses, and for others that enforced savings plan will come in the form of pet insurance. These days, a simple Google search will provide you with multiple options to protect your pet from accident or illness. You can opt to insure with large companies like Woolworths to niche insurers and new entrants, such as Fetch.\n\nWhile pet insurance won’t suit everyone, for those who need it, it can be a lifeline. We have analysed a wide range of policies to find our pick of the leading comprehensive pet insurance providers for Australian pet owners against a set of clearly defined metrics. You can read more about our methodology—and how we came to our select our favourites—below.\n\nNote: The below list represents a selection of our top category picks, as chosen by Forbes Advisor Australia’s editors and journalists. The information provided is purely factual and is not intended to imply any recommendation, opinion, or advice about a financial product. Not every product or provider in the marketplace has been reviewed, and the list below is not intended to be exhaustive nor replace your own research or independent financial advice. For more information on how Forbes Advisor ranks and reviews products, including how we identified our top category picks, read the methodology selection below.\n\nShow Summary\nPet Insurance Guides\nHow Much Does Pet Insurance Cost?\nCheap Pet Insurance\nDog Vaccinations\nPuppy Vaccinations\nCat Vaccinations\nVet Fees\nWhat Does Pet Insurance Cover?\nDoes Pet Insurance Cover Dental?\nDog Years to Human Years\nLargest Dog Breeds In Australia\nPet Insurance Reviews\nPetsy Review\nBow Wow Meow Pet Insurance Review\nPets On Me Pet Insurance Review\nTrupanion Pet Insurance Review\nWoolworths Pet Insurance Review\nRSPCA Pet Insurance Review\nFetch Pet Insurance Review\nFeatured Partners\n\nOur Pick of the Best Comprehensive Pet Insurance Policies\nPotiki Cat Insurance Platinum Cover\n4.8\n\nMaximum Annual Limit\n$30,000\n\nReimbursement Rate\n80%\n\nIs Dental Covered?\nYes, up to $1,000\n\nPotiki Cat Insurance Platinum Cover\nWhy We Picked It\nPros & Cons\nPet Insurance Australia: Major Medical Cover\n4.5\n\nMaximum Annual Limit\n$30,000, plus $145 for routine care\n\nReimbursement Rate\n80%\n\nIs Dental Covered?\nRoutine care provides $50 to put toward various procedures, one of which is teeth cleaning\n\nPet Insurance Australia: Major Medical Cover\nWhy We Picked It\nPros & Cons\nahm Pet Insurance Platinum Cat Cover\n4.5\n\nMaximum Annual Limit\n$30,000\n\nReimbursement Rate\n80%\n\nIs Dental Covered?\nYes, up to $1,000\n\nahm Pet Insurance Platinum Cat Cover\nWhy We Picked It\nPros & Cons\nTrupanion\n4.3\n\nMaximum Annual Limit\nNo annual limit\n\nReimbursement Rate\n90%\n\nIs Dental Covered?\nYes, pending conditions\n\nTrupanion\nWhy We Picked It\nPros & Cons\nBow Wow Meow Ultimate Care Plan\n4.2\n\nMaximum Annual Limit\n$20,000\n\nReimbursement Rate\nChoice of 60%, 70% or 80%\n\nIs Dental Covered?\nYes\n\nWith conditions\n\nBow Wow Meow Ultimate Care Plan\nWhy We Picked It\nPros & Cons\nFetch Pet Insurance\n4.0\n\nMaximum annual limit\n$30,000\n\nReimbursement rate\nChoice of 80%, 90% or 100%\n\nIs Dental Covered\nYes\n\nwith conditions\n\nFetch Pet Insurance\nLearn More\n\nOn Fetch's Secure Website\nWhy We Picked It\nPros & Cons\nKnose Pet insurance\n4.0\n\nMaximum Annual Limit\n$25,000\n\nReimbursement Rate\n90%\n\nIs Dental Covered?\nYes, as an add-on\n\nKnose Pet insurance\nWhy We Picked It\nPros & Cons\nPetsy Top Cover\n4.0\n\nMaximum Annual Limit\n$25,000\n\nReimbursement Rate\n90%\n\nIs Dental Covered?\nYes, pending conditions\n\nPetsy Top Cover\nWhy We Picked It\nPros & Cons\nWoolworths Pet Insurance Everyday Comprehensive Plus Cover\n3.8\n\nMaximum Annual Limit\n$30,000\n\nReimbursement Rate\n80%\n\nIs Dental Covered?\nNo. However, optional routine care offers a $50 benefit toward a choice of treatments, one of which is dental illness\n\nWoolworths Pet Insurance Everyday Comprehensive Plus Cover\nWhy We Picked It\nPros & Cons\nRSPCA Ultimate Plus Accident and Illness Cover\n3.8\n\nMaximum Annual Limit\n$20,000\n\nReimbursement Rate\n80%\n\nIs Dental Covered?\nNo. However, optional routine care offers a $50 benefit toward a choice of treatments, one of which is teeth cleaning\n\nRSPCA Ultimate Plus Accident and Illness Cover\nWhy We Picked It\nPros & Cons\nPetcover Superior Plan (Formerly Petplan)\n3.5\n\nMaximum Annual Limit\n$20,000\n\nReimbursement Rate\n100%\n\nIs Dental Covered?\nYes, pending conditions\n\nPetcover Superior Plan (Formerly Petplan)\nWhy We Picked It\nPros & Cons\nPets On Me Deluxe Policy\n3.3\n\nMaximum Annual Limit\n$20,000\n\nReimbursement Rate\n80%\n\nIs Dental Covered?\nYes, up to $500\n\nPets On Me Deluxe Policy\nWhy We Picked It\nPros & Cons\nWhat Methodology Did We Use?\nTo find the best comprehensive pet insurance policy for Australians, Forbes Advisor compared more than 25 different options. The most comprehensive offering from each pet insurance provider was analysed, so readers could get a clear picture of what top-tier coverage typically includes.\n\nTo compare each policy, Forbes Advisor looked at 16 key attributes. Included in those key attributes were four specific ‘basics’: the reimbursement rate at the vet; how the reimbursements occur (on the spot or via a claim); the maximum annual limits on claims; and whether routine cover is included.\n\nThese four basics were then ranked out of possible 50. Top marks were awarded if routine care was offered; if there was a GapOnly service that allows guardians to pay the gap only rather than the whole cost up front; if the maximum annual limit was over the industry standard of $15,000; and if the reimbursement rate was higher than the standard 80% of bills.\n\nWe also looked at a range of other factors:\n\nHow many levels of cover the pet insurance provider offers;\nLength of wait periods;\nWhether or not dental is covered;\nIf the policy has a sub-limit for tick paralysis;\nWhether your pet is still covered if you travel with them to New Zealand or the Norfolk Islands;\nIf there is a choice of excess, as many consumers enjoy this option;\nAny limits on the age of the pets that the policy will insure;\nIf the provider will pay for emergency boarding fees, and what the maximum of such cover would be;\nWhether there is a choice to add-on vet bill cover for things such as behavioural treatments or alternative therapies;\nWhat discount is offered when insuring multiple pets, if there is a discount;\nIf there are any other additional bonus features, such as FlyBuys points or discounts on other policies with the same provider; and\nWhat the average product rating review is of the policy from customers via independent consumer site, ProductReview.\nRelated: Guide to dog vaccinations\n\nWhat About Price?\nYou will notice that price wasn’t one of the criterion we used to evaluate pet policies. This is because price is determined by a range of variables depending on your pet’s age, breed, whether you pay monthly or annually and even whether you have made a claim. The best way to find the most cost-effective policy is to shortlist a few favourites and then obtain quotes.\n\nAbout Star Rankings\nYou will note that we have included a star rating next to each product or provider. This rating was determined by the editorial team once all of the data points above were considered and the pros and cons of each product attribute were reviewed. The star rating is solely the view of Forbes Advisor editorial staff. Commercial partners or advertisers have no bearing on the star rating or their inclusion on this list. Star ratings are only one factor to be considered, and Forbes encourages you to seek independent advice from an authorised financial adviser in relation to your own financial circumstances and investments before you decide to choose a particular financial product or service.\n\nWhat Is Pet Insurance?\nWe’re used to taking out insurance to cover a wide variety of potential calamities—be it regarding our health, our homes, our cars, our holidays and even our lives.\n\nSimilarly, pet insurance is designed to give us peace of mind that when it comes to our four-legged friends, we’re covered. By taking out a pet insurance policy, you receive help to cover unexpected veterinary expenses when your pet gets sick or injured. Most pet insurance policies are targeted towards cats and dogs, however, there are pet insurance policies for ‘exotic’ pets, such as rabbits or birds, but not all insurers cover these types.\n\nAs with other types of insurance, pet insurance works by paying a monthly or yearly premium to the insurance provider. If unexpected veterinary expenses arise, and your policy covers the event, you’ll be able to make a claim with your provider instead of footing the bill yourself.\n\nThe Importance of Pet Insurance in Australia\nIn Australia, dogs are the most popular pet. Research shows almost half of Australian households have at least one dog, and a third of all households have at least one cat. Add in other animals to the mix, such as birds, rabbits, turtles and guinea pigs, and it’s clear that Australians love their pets. But that love does not come cheap.\n\nNicole Rous, director of Mont Albert Vet, tells Forbes Advisor that without pet insurance, veterinary treatments for accidents or illnesses can cost anywhere between $500 to $10,000–with even minor surgeries costing more than $2000.\n\nBut it’s not just surgeries that can burn a hole in your pocket. “An average GP visit would be over $200 these days,” Rous explains, as a consult could be $95 plus the necessary medication following the appointment. So while it’s not a requirement to have pet insurance in Australia, and while vets won’t refuse treatment without insurance as long as the owners are happy to pay the bill, pet insurance is still a “no brainer” to Rous.\n\nYou don’t want to have to say goodbye because you can’t afford life saving surgery, Rous says.\n\nPlus, Rous adds, budgeting a set amount each month towards your pet insurance premium and then not having to deal with bill shock when the need for a procedure arises is much easier on the pocket, especially as the cost of living increases.\n\nPet Insurance in the Dog House\nUnfortunately, in the past pet insurance has been blighted by a lack of competition, although that has changed in recent years. Nevertheless, the industry remains dogged by reputational issues, namely that it is little more than ‘junk insurance’, which is how Financial Counselling Australia referred to some parts of the sector in a submission to ASIC in 2019.\n\nAs vet bills have risen in line with inflation, so too have pet insurance policies—in some case by as much as 50%. With many insurers refusing to insure pets over the age of nine, especially dogs, many consumers feel locked in to certain policies as they’re unable to shop around once their pet reaches a certain age. Consumers will need to weigh up whether pet insurance is worth the cost in these situations or whether they’re best to pet aside money for their pet’s treatment, or potential illness, each month.\n\nIn June 2023, ASIC instigated 38 interim stop orders for a 24-hour period pertaining to 67 pet policies issued through major insurance underwriter Hollard and its subsidiary PetSure. The corporate regulator was concerned the companies failed to properly consider the ability of the consumer to make up-front payments for vet bills before reimbursement. The stop order affected brands such as Woolworths, RSPCA, Petbarn, Guide Dogs, Medibank, Bupa and HCF. Within 24 hours, the stop orders were lifted after the companies addressed ASIC’s concerns regarding the target market determination of its customers and updated its policies accordingly. You can read ASIC’s original media release in full here.\n\nRelated: Pets On Me Insurance Review\n\nTiers of Pet Insurance\nThe types of pet insurance available on the market varies greatly between providers However, most commonly, there are three types of pet insurance:\n\nAccident-only insurance: cover for veterinary costs if your pet is in an accident. As this is the entry level of insurance, it is the cheapest. However, if you keep your pet at home during the day, and only walk it on lead, it may not be necessary or useful.\nAccident and illness insurance: this covers accidents and also if your pet gets sick, however, most insurers won’t cover pre-existing medical conditions on this policy.\nComprehensive insurance: the most all-inclusive type of policy, covering your pets for accidents, illnesses, preventative care and more. All comprehensive policies are different, so some may include routine checks such as vaccinations or teeth cleaning, while others may only offer these at an additional cost.\nIt’s worth noting that not all pet insurance providers will use these terms in relation to their offers. Some describe their cover a ‘basic’ or their top cover as ‘ultimate’, while others might classify them by the type of pet–such as for a young dog or an indoor cat.\n\nAdditionally, you may already have access to pet insurance and not even realise it. Some home and contents insurance providers offer pet insurance as an optional extra when you already have a policy with them. It’s paramount that you review the PDS carefully–especially as this type of add-on pet insurance may not be as comprehensive as a dedicated policy.\n\nRelated: How much does pet insurance cost?\n\nWhat Does Pet Insurance Cover?\nLike any type of insurance policy, your level of cover will depend on the tier that you choose. Commonly, basic pet insurance policies will cover treatments for tick paralysis; accidents and injuries, including radiology and pathology; prescribed medications; non-elective surgeries; and other necessary care.\n\nMore comprehensive plans, however, may also cover more niche–or more expensive–needs, such as dental care; behavioural problems; boarding fees; cover for hereditary conditions; and even routine care, such as regular vet visits.\n\nEven policies that advertise themselves as ‘comprehensive’ or ‘ultimate cover’ still do not include all of the above.\n\nThis is why no matter what insurance policy you are considering, you must carefully review the PDS to ensure you’re adequately covered.\n\nDoes Pet Insurance Cover Pre-Existing Medical Conditions?\nIt depends. As each provider and policy is different Rous says it’s best to take out insurance for your pet when they are young, rather than waiting for them to acquire a condition or illness.\n\nCommon Exclusions\nWhen comparing comprehensive pet insurance policies in Australia, you’re likely to come across a few common exclusions. A common exclusion, unfortunately, is routine care, such as vaccinations, de-sexing, de-worming and check-ups.\n\nMany policies offer routine care as an add-on to their comprehensive policy, allowing you to bolt it to your pet insurance at an extra cost.\n\nBe aware that dental care is also commonly excluded as is cover for senior dogs and emergency boarding cover for your pet if you are hospitalised or unable to care for them.\n\nYou can read more in our guide to pet insurance coverage.\n\nRelated: Is pet insurance worth it?\n\nHow To Compare Pet Insurance Policies\nJust like with your health insurance, it’s hard to know what type of things your pet will need help with. So how do you choose a pet insurance policy?\n\nIf you’re unsure, it’s best to opt for the most comprehensive policy to ensure you’re covered for a wide range of mishaps. If your pet does have a pre-existing condition, or is over a certain age, then it is paramount you also check that your policy will still cover them.\n\nYou should also consider any general policy exclusions and sub-limits, any additional benefits you might be entitled to, and what–if any–waiting periods apply.\n\nOf course, a major consideration of any pet insurance policy is whether you can afford it. Just like veterinary bills, pet insurance is costly–but it can save you a lot of money and stress if your pet needs care.\n\nFind a policy which fits into your budget by making sure you can pay the monthly premium. Also check with your local vet if they offer discounts with certain providers, too.\n\n    "
]