[
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "471 reviews"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "When It Matters Most – I was completely shocked when I saw the renewal bill for my pet insurance. After five years without a claim, the cost just kept going up, and I was seriously thinking about cancelling. Then, out of nowhere, my little Maltese got really, really sick. A trip to SASH turned into a nearly $8,000 bill within just a few hours. Tha… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "We’ve had our dog insured since 2021 with medibank & reluctantly made a call to cancel our cover. I was greeted by Francis who provided some reassurance by offering 3months free cover for the interim. Thank you Francis, your explanation of our existing cover, help with additional options & customer service today was much appreciated. Well deserved… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "One Happy Chappy – Took out my Pet Plus policy with Medibank in October, switched from another insurer. Easy to switch over, purchase was smooth, the claims process is where Medibank truly shines. My dog Skyla required surgery to remove a growth, and skin biopsy last Friday. I submitted the claim on Monday and got reimbursed Wednesday! 80% back, e… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "10 years of service – Thank you so much for service, always helpful and friendly. My reimbursements were quick to my bank. I can recommend this pet insurance."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Nathan was a real star on my call today! – Nathan provided fabulous, pet-friendly assistance today. Thank You, I appreciate your caring."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Excellent. Easy to claim and fast approval – My 16 weeks old Toy Poodle had an accidental fracture that needed a very expensive surgery to repair. Medibank has been amazing and we couldn’t recommend the ultimate policy high enough. After paying more that $5000 in Vet Fees ( surgery, overnight stays, medication etc) a claim was made and 80% of what… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Quick claims, but limited coverage – I have had pet insurance for my blue heeler for about a year now, and had to use it for the first time recently. My dog ate onion scraps in the middle of the night, and had to go to the emergency vet to safely bring it up before it could cause issues. Emergency vet bills are always the most expensive, so it co… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Medibank   Hi Wren, We are sorry to hear your dog was unwell, but we are happy to hear that the claiming proces… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Easy to change the insurance cover – I spoke to Rome on the phone to change the cover of my pet insurance, and he was friendly and made it very easy. In a matter of minutes I have my cover changed to what I had in mind. Thank you so much!"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Highly recommend – The customer service at Medibank pet insurance are very friendly, patient and knowledgeable. They are truly cares about its customers. Highly recommend."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Thank you Medibank Pet Insurance! – Our 18 month old puppy became very unwell with a random parasite infection, and thank goodness we had taken up Medibank pet insurance last year in case of emergencies like this! It was an awful experience to see him so sick, and he required intensive medical care including several days in an emergency animal cent… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Not great – Tried to claim for routine care, and went to the vet for prevention check up for my Dog's eyes but saw that my dog was offered a cream for his eyes, even though he has no eye conditions the vet only suggested if I wanted it. But, it was unnecessary as he has no issues. The vet also agreed he didn't need it by the end anyways, but the cl… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Medibank   Hi Annie, I can see you've reached out to us via Private Message - so I'll reply to you there. - Cat… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Ridiculous price hikes – We have beed loyal clients for 13 years with our Pet Policy and Private medical. The price initially was acceptable for the Pet Insurance but the moment our dog turned 8yrs the increments of price hikes doubled.... in 4 years our instalment jumped from $120 to $275 ... how could you ever justfy such steap price hikes every… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Know better, choose better."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Save same time and look past this company – I am on my 3rd attempt to take out pet insurance. I have waited on hold for 20 mins to talk to someone twice only to be hung up on without even an answer(middle of the days-am). So I called Medibank life insurance they answered straight away and couldn’t help or say why the pet area wasn’t working. Im… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Medibank   Hi there, We are sorry to hear about the difficulties you’ve experienced with contacting the Pet Ins… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Super great service experience – Amazing customer service experience today. I am suffering severe financial hardship right now, and was actually phoning to cancel my pet insurance, which I *really* did not want to do. The consultant was able to assist me with a solution to maintain my pet insurance while I seek higher paid employment. Super helpful… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Friendly, helpful customer service – Spoke to Ar-Em after the premium increased substantially. He was able to provide me with an option that enabled me to continue the policy. I find the online claims process easy to use and claims paid quickly."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "A positive experience – 9/1/24 Kai from the Medibank Pet Insurance Customer Support team was extremely professional and acted promptly to provide a positive resolution. I was very pleased with the support provided by Kai . I was delighted with the outcome and diligence shown by Kai in addressing my concerns. Thank you."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Excellent service provided by Mahdi – I had a wonderful experience with Mahdi from Medibank Pet Insurance. He was incredibly patient and thorough in assisting me with exploring alternative options to my current cover. Mahdi took the time to understand my needs and explained each option clearly, ensuring I was clearly aware about my options. His pro… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Excellent Customer Service – I am writing to thank June for the quality of service provided by your company. We sincerely appreciate his efficient, gracious customer service, the level of detail and accountability he has demonstrated to solve our problem with regards to our claim submitted"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Great cover, great price, easy claims – Excellent cover options at an affordable price - much cheaper than other companies I got a quote from. Customer service is also great, claiming was really easy."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Great cover, easy claims – Recent claim experience using GapOnly was flawless. The vet took care of everything and all I paid was the gap. Medibank also recently auto rolled me over to their latest products with higher limits and better converge. No concerns with their cover and service in the 6 years I have been with them."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Change of plan – I was going to cancel my pet insurance plan with medibank but the lady from the customer service, Catherine did an amazing job and gave me good deals to stay and upgrade my plan with pet insurance."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Know better, choose better."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Pleasant Medibank pet insurance phone support (June) – Spoke to June who was very helpful in explaining the renewal premium increase and why it differs from a brand new online quotation with identical terms. He also offered a 25% discount of the premium. \"To apply this offer, the annual premium must be paid in full and once collected we will provi… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Good customer service received – when I contacted Medibank regarding pet insurance renewal I was thinking that I would be cancelling my policy and the policy of my other two pets. Had a delightful you man called Bill who asked me what I really wanted to do. Which was to keep some protection for my pets as they were all older . He offered an option… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "They hiked my policy up by 77% in 3 years – For a start, my pet policy without adding any additional extras went from $62.51 for the first year, to $83.29 for second year, and now just jumped to $111.05 PER MONTH! That's a 33% increase just this year alone, but over 3 years, they've hiked my policy up by 77% seriously, 77% in 3 years . And do I… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-private-pet-insurance",
        "review": "Medibank   Hello Kj, Thank you for sharing your detailed experience, and I apologise for the frustration you've… Read more (+9 replies)"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "82 reviews"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Save same time and look past this company – I am on my 3rd attempt to take out pet insurance. I have waited on hold for 20 mins to talk to someone twice only to be hung up on without even an answer(middle of the days-am). So I called Medibank life insurance they answered straight away and couldn’t help or say why the pet area wasn’t working. Im… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Medibank   Hi there, We are sorry to hear about the difficulties you’ve experienced with contacting the Pet Ins… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Worst insurance company ever – If I could rate 0 I would. What a joke. My dog was brought into Australia from overseas had to go through extensive testing to ensure he was healthy. Only 3 months in Australia and he had to have a procedure which resulted in desexing, some teethe remove and a lesion cut out. The total vet costs were $1800. Insurance… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Medibank   Hi Karen, thank you for taking the time and leaving your review. I hope your dog has recovered well… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Excellent. Easy to claim and fast approval – My 16 weeks old Toy Poodle had an accidental fracture that needed a very expensive surgery to repair. Medibank has been amazing and we couldn’t recommend the ultimate policy high enough. After paying more that $5000 in Vet Fees ( surgery, overnight stays, medication etc) a claim was made and 80% of what… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Price gouging and no respect for the veterinary profession – I am a veterinarian who has had Medibank Insurance for my dog for 8years. Her Monthly premium is now $208 a month, increasing 25% per year in the last 4 years, when on average I have claimed less $300 per year for her arthritis medication. They offer no professional discount ( unlike othe… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Medibank   Hi Kaitlyn and Pepper, Thank you for reaching out and for your review. I’ve sent you a private messa… Read more (+4 replies)"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "2 claims made and very happy – Our Lab girl has been fighting off a nasty ear infection since the start of the year. 7 trips to the vet and well over $1000 in bills. I honestly never thought my insurance would cover that. But it did. I sent the invoices and the vet consult notes and I’m beyond happy with the outcome. The return was fair and it’s de… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "problem adding my claim – Matt was so helpfull and patient guideing me through the portal. im not freat on line and the fact that he was so kind and thoughtful really made my day."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Thank you Nathan – Nathan was very helpful, taking the time to answer all my questions. He was polite and resolved all my concerns effectively and efficiently. Wonderful phone manners and customer service."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Seriously, don’t bother – Got the ultimate pet insurance and thought this will save me heaps! Nope! Just had a vet visit for $1800 and got a whopping $19.50 back (and only got that back after they “mistakingly” rejected my claim). A few separate line items of things that were apparently pre-existing but no notations from my vet indicating as such?… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Medibank   Hi Tania. Thank you for bringing this to our attention and for your review. We are sorry that you ha… Read more (+1 reply)"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "No better than a scam pet insurance – My dog recently had two visits to the vet. The first was to investigate a sore paw. This required sedation. Cost was about $450. Second visit was a follow up and additional annual vaccination and ear check. Cost was about $320. Medibank Pet insurance split the invoices into different sections and charged two ev… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Medibank   Hello Rob, Thank you for informing us about your experience with your Pet Insurance. We apologise if… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Read the product disclosure carefully! – We cancelled our Ultimate pet insurance today for our two puppies during the cooling off period after paying $1200. So mad! One of our puppies saw a vet due to diarrhea which turned out to be caused by her expensive kibble. She also wasn’t toilet training like her brother, so I mentioned it to the vet who… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Medibank   Hi there, thank you for your review and reaching out regarding your experience for Pet Insurance. I'… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Thankyou – I was unable to pay my premium on time and was granted a payment extension, no questions asked and no penalty imposed. The customer service officer, Jet, was extremely helpful. This is an insurance company that understands that the cost of living is biting and cares about its policy holders."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Friendly and helpful – I hold a number of policies with Medibank Pet Insurance and have always found the claiming system easy to use and the Team have always been friendly and helpful."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Know better, choose better."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Small price to pay for complete peace of mind – We have been unlucky enough to have had to make 3 biggish claims in the last 5 years, but each time Medibank has been easy to deal with and provided prompt payment to the extent insured. Total vet bills would have left us around $30K out of pocket, instead we paid around $6k - big difference! The gap… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Easy to manage pet insurance – Medibank pet insurance is easy to manage. Easy claims process, clear terms and conditions, and quick claims resolution. Very happy with this product for our Corgi!"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Relieved we have this pet insurance – Lumps were discovered on my dog’s backside. The vet said that a biopsy needs to be performed and provided me with estimates, depending on what they discover. The estimates ranged from hundreds of dollars to thousands of dollars. It is such a relief knowing that 80% of the costs will be covered. I submitted a pr… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Easy to claim and prompt payment – Can’t speak highly enough of Medibank pet insurance. Our dog ended up in the vet for 48 hours. Initially thought it was a snake bite but when he didn’t respond to anti venom it was narrowed down to mushroom toxicity poisoning after finding crops of the yucky fungus in our backyard. The online portal was extremely… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Great policy to cover expenses to look after our beautiful furry friend – Customer service was great and I was made aware of expenses I can claim for the treatment of my dog which I didn’t know"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "This is perfect! – Very patient and helpful! Great staff and solve all my questions."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Amazing service and benefits – This review has been a few weeks in the making as I’m still trying to come to terms with losing my beautiful Rottweiler. Medibank have been absolutely amazing with all of the claims I’ve had to submit for my boy over the last few months and I get money returned so quickly! I honestly can not fault them one bit. I had… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Worst customer service with zero consideration for anything outside of their scripted responses – Full of excuses and loop holes when trying to make a claim. Internal dispute representative was even worse to talk to than the customer service team members I dealt with. They have a script that they need to say and just repeat that over and over again… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Medibank   Hi Jen, Thank you for reaching out to us and for your review. I’ve sent you a private message so we… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Purchaser Beware – I was a customer with Medibank Pet insurance and Medibank Health Insurance for approximately six years. I was a loyal customer. Over the course of the period, I lodged three claims for my pet insurance. None were approved. When I cancelled my insurance policy to move to a vet recommended provider, Medibank offered to reinstate on… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Medibank   Hello, Thank you for reaching out and I'm sorry to read of your experience. If you would like to dis… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Know better, choose better."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Price Gouging at its finest – I pay monthly instalments for my dog insurance. When I took out this policy 2 years ago, I did it for the name thinking they would be the best and their pricing was on par with other providers. For the 2nd year running, I have just been smashed with an increase of $40 PER MONTH on my renewal, with a minimal amount clai… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Medibank   Hi Sam and thank you for getting in touch with us. I’ve sent you a private messaging asking you for… Read more"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Pet insurance is invaluable – I adopted my cat eight years ago and took out pet insurance two months later. Late last year she became ill and was diagnosed with lymphoma. Her treatment is ongoing but I made a claim a few months ago for the charges to that point. I submitted invoices totalling nearly $9,000, and three days later I received an email… Read more ·  1"
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Worst Insurance product I have Invested in – Everything you try to claim is either Pre-existing or not covered. Nowhere is any mention of these terms in the PDS or documentation but they will reject anything and everything that comes their way."
    },
    {
        "url": "https://www.productreview.com.au/listings/medibank-pet-insurance-ultimate-pet-care",
        "review": "Medibank   Hi Digvijay, I've sent you a private message, to obtain your contact details and assist you further.… Read more"
    }
]