[
    {
        "review": "8,035 reviews"
    },
    {
        "review": "RSPCA team have been amazing to deal with. Everything is fast and easy, when we got our dog he hasn’t had a good start to life but RSPCA Insurance team and cover have been god send for him l do really appreciate what they have done thank you"
    },
    {
        "review": "We are so glad we chose RSPCA pet insurance for our dog. We have been with the insurance company for 4 years now. Claims have been processed efficiently. Highly recommend!"
    },
    {
        "review": "Today my intention of calling was to cancel my fur baby’s insurance as it’s not affordable for me but the person that helped me a lot his name is Srancis and I’m continuing my policy for my fur baby at the end of our call very much appreciated."
    },
    {
        "review": "I wish to complement Louisa for an excellent job over the phone. Very well mannered. Absolute 5 star for me. One happy customer. Thank you Tracey"
    },
    {
        "review": "A smooth claim process – Another recent claim and all went smoothly. I’m so glad we have RDPCA pet insurance. It certainly helped with our most recent visit which was quite expensive. Our vet is Gap Only so that’s even better. You just never know when it will come in handy!"
    },
    {
        "review": "Cats paradise! – The operator who served me was very friendly and polite and had excellent English eloquence so I could understand everything I was committing to! I am forever grateful for the RSPCA which has given me peace of mind knowing that my cat is in the best of hands! Thanx RSPCA!"
    },
    {
        "review": "A life savour – All claims are dealt with fast never had a problem the only thing I find is it is a little too expensive being on a pension I find my payments high. We have been with rspca for over 7 years highly recommend"
    },
    {
        "review": "Streamlined service – I joined my husky in February .we had a health check I told the vet I joined .the staff did all the paperwork Submitted the claim .I received a rebate..a cheque in the mail so quickly..it's a streamlined service..wow Great value Thanks, R.S.P.C.A Jennifer and Luna-may"
    },
    {
        "review": "RSPCA ALL THE WAY – Brilliant, no problems with the both the ease of claim nor problems of rejection thank you"
    },
    {
        "review": "Life Saver – I can hand on heart recommend RSPCA Ultimate + pet insurance. I have a 3 year old Yorkie who needed after hours medical attention for toad poisoning (why do emergencies always occur after hours??). The vets took care of the claim and the quality of the rebate was a life saver for us both. Absolutely recommend for peace of mind in carin… Read more ·  1"
    },
    {
        "review": "Happy RSPCA fur-mommy for over 8 years! – We have 2 huskies covered and receive the multi-discount. As a loyal customer, I was shocked to see the renewal premium go up by 30% for our furbaby Jakey so I contacted RSPCA and spoke to a lovely consultant Eka. Eka was empathetic to my concerns and discussed with me whether I required the level of policy… Read more ·  1"
    },
    {
        "review": "On-line Claim was handled very quickly – Our Labradoodle is 3 years old and apart from yearly vaccinations, hasn't been to the vet. Due to a gastro upset, he needed treatment . We lodged our claim on-line and everything went smoothly, keeping us up to date with progress, and the refund was to us within 3 days."
    },
    {
        "review": "Know better, choose better."
    },
    {
        "review": "I'm glad I took out this policy! – I have had my Labrador insured with RSPCA for nearly 10 years, I have found that the service is excellent with fast claim and payment refund processing. My last claim was lodged on Wednesday and the payment was in my bank account on the Friday of the same week. Two day turnaround, you can't ask for more than that… Read more ·  1"
    },
    {
        "review": "Wouldn’t be without it! – Wouldn’t be without my pet insurance!!! My baby dogs are proving to be very injury prone and RSPCA pet insurance has been amazing! Very quick and efficient"
    },
    {
        "review": "Great service – Easy to claim and quick turn around to getting your refund"
    },
    {
        "review": "Excellent experience – I got RSPCA insurance when I got my first dog around twelve years ago. I’ve always had a pleasant experience with them and since they do gaponly it’s been really easy for me to pay for even some more expensive recent bills as we’ve tried to figure out my mini foxies recent throat issues."
    },
    {
        "review": "Claim – so quick and easy striaght from vet and into account within days - love this service and reassurance for my sheepadoodle"
    },
    {
        "review": "It’s not much for peace of mind. Super FAST claim – After many tests My beautiful dog was diagnosed with a brain tumour and had to be euthanised within a few hours. CoCo was only 3yrs old and had been insured for that time. The bills for hospital and testing were a lot but RSPCA approved the claim within 5mins so I was able to spend precious mom… Read more ·  1"
    },
    {
        "review": "My dog needed urgent attention after a bout of pancreatitis. He needed diagnostic tests and medication. The bill was over $500. I am a pensioner. My insurance covered 80% on the spot and I only had the pay the gap. It was such a relief for my dog to receive care and my budget not too adversely affected."
    },
    {
        "review": "Seven our dog had a operation to remove a lump, the vet asked if I had pet insurance. I justed quoted the number and it took no more then five minutes... I just paid the gap and that was it... couldn't be easier thanks for the no hassel approach 5 stars... I have had the insurance for both my dogs for almost 3 years now..."
    },
    {
        "review": "We have been with RSPCA pet insurance for nearly 3 years now and have made numerous claims. The procedure is pretty straight forward and claims are paid promptly."
    },
    {
        "review": "Know better, choose better."
    },
    {
        "review": "Considering you're told that you can get a return of up to 80% back and you get back nowhere near that you kinda feel used and lied too. I would have thought getting your animal de-sexed would qualify you for a larger return."
    },
    {
        "review": "RSPCA Pet Insurance   Hi Richard, Thank you for sharing your review with us, I am deeply sorry to hear about any dissatisf… Read more"
    },
    {
        "review": "Do not do direct debit - run your account dry – So upsetting! I have lost my job and been struggling to make ends meet. I have had my RSPCA policy for over 4 years and have never made a claim. After struggling to make my payments I have been checking my bank account and noted that they have been taking out more money than the policy cost and have b… Read more"
    },
    {
        "review": "RSPCA Pet Insurance   Hi Alison, Thank you for sharing your review with us, I am deeply sorry to hear about any dissatisfa… Read more"
    },
    {
        "review": "RSPCA rep damaged by greedy Holland Insurance – Inflexible profit/money focused pet insurers. A poor reflection on RSPCA My dog was a few day from the expiry of the waiting period when she injured her ACL. I appealed to RSPCA pet insurers for some compromise or leniency. Blanket NO … If I had waited a few days an ignored net pain she would have… Read more"
    },
    {
        "review": "RSPCA Pet Insurance   Hi Paule, Thank you for sharing your review with us, I am sorry to hear about any dissatisfaction th… Read more (+8 replies)"
    }
]